Revit 2027 API
BuiltInFailures.StairRampFailures.CannotSplitRailingWithExtensions Property
 Railings with extensions cannot be split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitRailingWithExtensions { get; }
Public Shared ReadOnly Property CannotSplitRailingWithExtensions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitRailingWithExtensions {
	FailureDefinitionId^ get ();
}
static member CannotSplitRailingWithExtensions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace